----<><><><><><><><><><><><>---<><><><><><><><><><>---<><><><><><><><><><>---
--Copyright (c) 2009_Esmaeel almansoori_(~alkoon_Universo~)_ al-koon-11@hotmail.com
--http://jnazh-karaoke.ahlamontada.net/forum.htm
----<><><><><><><><><><><><>---<><><><><><><><><><>---<><><><><><><><><><>---
-- ÈÓã Çááå ÇáÑÍãä ÇáÑÍíã.
-- Şæã ÈÊÍæíá ÌåÉ ÇáÏÑÓ Åáì ÇáÌåÉ ÇáÅäÌáíÒí ( ÇáŞÑÇÁÉ ãä ÇáíÓÇÑ Åáì Çáíãíä ) Ü
-- åĞå ÇáÓßÑÈÊ ÊåÏì Åáì Çáãáß ÇáÚÇã.
-- ŞãÊ ÈÍĞİ ÇáÃãæÑ ÇáÛíÑ ÇáÖÑæÑíÉ áíßæä ÇáÓßÑÈÊ ÎÇáíÇ ãä ÇáÊÚŞíÏ.
-- ÈÚÖ ÇáÃãæÑ áã ÃÔÑÍåÇ¡ áÃä ÌäÇÒÉ ÔÑÍåÇ İí ãæŞÚå ÇáŞÏíã ÃÑÌÚ áåÇÇÇ.
-- Ass Draw ŞÈá ŞÑÇÁÉ ÇáÓßÑÈÊ ÑÇÌÚ ßÊÇÈ ÔÑÍ ØÑíŞÉ ÇáÑÓã ÇáÊí ÚãáÊåÇ 
----<><><><><><><><><><><><>---<><><><><><><><><><>---<><><><><><><><><><>---

---XxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxX--XxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXx---
--## -- Åä ÔÇÁ Çááå ÑÇÍ ÇÌÏÏ ÇáÔÑÍ (Åä ÏÚÊ ÇáÖÑæÑÉ ) æãä ßÇä íÚÑİ ÃãÑÇ Ãæ ÔÇåÏ ÎØÃ İÇáíÚáãäí ÈÇáÃãÑ --##--
---XxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxX--XxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXxXx---

--# åí Çáåíßá ÇáÚÙãí áãÌãæÚÉ ÇáæÙÇÆİ ÇáÊí ÈÑãÌÉ áåÇ ÇáÓßÑÈÊ ¡ æÈÔßá ÃÓÇÓí áÚãá ÊÎØíØ áãáİ ÇáßÇÑÇæßí ÇáãÄŞÊå ¡æáÎáŞ ÊÃËíÑÇÊ ÇáßÇÑÇæßí ÇáãÊŞÏãÉ ÈÇáÅÖÇİÉ ááÚÏíÏ ãä ÇáæÙÇÆİ ÇáãÓÇÚÏÉ ÇáÃÎÑì 
include("karaskel.lua")
 
------------------------------------XxXxXxXxXxXxXxXxXxX--------------------------XxXxXxXxXxXxXxXxXxX----------------------------------------------
script_name = "Future Windy Blur" --# ÇÓã ÇáÓßÑÈÊ
script_description = "Highlights blown away by the winds of change." --# æÕİ ÇáÓßÑÈÊ
script_author = "jfs.(FX'ALKOON')" --# ßÇÊÈ ÇáÓßÑÈÊ Ãæ ÇáãÄáİ 

---# ÃãæÑ ÅÖÇİíÉ İí ÇáÓßÑÈÊ áßäí ßÊÈÊåÇ ááÒíÇÏÉ #---
script_modified = "alkoon_9:33_Thursday_ PM 8/6/2009" --# ãÚÏá ÇáÓßÑÈÊ
script_lesson = "alkoon" --# ŞÇã ÈÚãá ÇáÔÑÍ -- åĞå ÃíÖÇ áíÓÊ ãæÌæÏÉ ÈÇáÃğÕá¡ áßäí ŞãÊ ÈßÊÇÇÈÊåÇÇ ááÍŞæŞ
-----------------------------------XxXxXxXxXxXxXxXxXxX--------------------------XxXxXxXxXxXxXxXxXxX----------------------------------------------


--## Èãáİ ÇäßáæÏ ÇáãÑİŞ ãÚ ÈÑäÇãÌ ÇáÅíÌí ÓÈ  karaskel-outo4 ÈÑãÌÉ ÇáÓßÑÈÊ Úáì Úãá ÇáæÙÇÆİ ÇáÊí ÓäÍÏÏ áåÇ ¡ æåí ÈÇáÃÕá æÙÇÆİ ãÎÊÕÑ áÓßÑÈÊ 
function new_windy_blur(subs) -- subtitles - ass ÃæáÇ : äÍÏÏ ÃÓã æÙíİÉ ÇáÓßÑÈÊ æäæÚ ÊÃËíÑåÇ áÊØÈíŞåÇ ÈÓßÑÈÊ Ü
	aegisub.progress.task("Applying effect...") --  ãåãÉ æÙíİÉ ÇáÅíÌí ÓÈ åæ (ÊØÈíŞ ÇáÊÃËíÑ ) Ü
	local meta, styles = karaskel.collect_head(subs)	
	local i, ai, maxi, maxai = 1, 1, #subs, #subs --# ÇáÔÑÍ ÈÇáÃÓİÜá

--[[
local i, ai, maxi, maxai = 1, 1,
ass  åí ãÊÛíÑÇÊ áÍÓÇÈ ÚÏÏ ÃÓØÑ ãáİ ÇáßÇÑÇæßí æÇáÊí åí  
subs :  ÇáãŞÕæÏ åäÇ åæ ãáİ ÇáÊæŞíÊ ÇáßÇÑÇæßí æãÚÑİÉ ÓØæÑ ãáİ ÇáÊæŞíÊ
# : åĞí ÇáÚáÇãÉ (ÔÇÑÈ) æÇáÊí ÊÔíÑ Åáì ÇáãÕİæİÇÊ Ãæ ÇáÌÏÇæá¡ æÇáÊí åí ÈÇáÃÕá ÊíÊÑÇÊ ãáİ ÇáßÇÑÇ ÇáãÄŞÊÉ æÇáÊí ÊÔÈå ÇáÌÏæá ÇáãäÙã
]]--
	while i <= maxi do --# Êã ÔÑÍåÇ ÈÇáÓßÑÈÊ ÇáÂÎÑ
	aegisub.progress.task(string.format("Applying effect (%d,%d)", ai, maxai)) -- ass ÇáãÓÄæá ÇáÃæá áÊØÈíŞ ÓØÑ ÇáÊÃËíÑ(Ãæ ÇáÃßæÇÏ) æÊØÈíŞåÇ Úáì ãáİ 
 --# æÇÖÍÉ ßæÖæÍ ÇáÔãÓ İí ÇáäåÇÑ - ÇáÅíÌí ÓÈ ÊŞæã ÈÊØÈíŞ ÇáÓßÑÈÊ ãä ÃŞá ãä ÕİÑ ÍÊì ÇáãÆÉ íãßääí ÊÛííÑ åĞå ÇáãÚÇÏáÉ æÚãáåÇ ÈØÑíŞÉ ÃßËÑ æÖæÍÇ æáßä áäÏÚ ÇáÃãæÑ ßãÇ åí		
aegisub.progress.set((ai-1)/maxai*100) --# Şã ÈÍĞİ ÇáãÆÉ æÇßÊÈ ÚÔÑÉ æáÇÍÙ ÇáİÑŞ æÓíÙåÑ áß ÇáÍŞÇÆŞ 
--# aegisub.progress.set(percent"100") 
--#Set the position of the percent-done bar in the progress window.
		local l = subs[i] --åĞí áŞÑÇÁÉ ÇáÓØæÑ : Úä ØÑíŞ ÇÓÊÑÌÇÚ ÇáÓØæÑ (ÇáÎØæØ) ÇáãİåÑÓÉ æÅäÔÇÁ åÏİ æÈíÇäÇÊ ÌÏíÏå Íæáå


--[[	
 -->> line is lßãÇ åæ ãÚÑæİ ÇÎÊÕÇÑ
æÇáÓØæÑ Çáí ßÊÈÊåÇ ÈÇáÃÓİá ÊÈÏÃ ÈÜ (ÇááÇíä )İÃäÇ İåÑÓÊåÇ ÈÃæÇãÑ ãËá ÇæÇãÑ ÊØÈíŞ ÓØÑ ÇáÊÃËíÑ æÊæŞíÊ ÇáÈÏÇíÉ æÇáäåÇíÉ æßáåÇ ÈÏÃÊ ÈÇáÇíä 

                  *Effect--->line.text = string.format("{\\pos(%d,%d)\\an5\\fad(100,0)}%s", line.left+syl.center, line.middle, syl.text )
	*timer op--->line.start_time=line.start_time-100 + Universo
	*timer end--->line.end_time=line.start_time+syl.start_time
	*layer--->line.layer = 1

local l = subs[i] --ßãÇ ŞáÊ ÓÇÈŞÇ åĞí áŞÑÇÁÉ ÇáÓØæÑ : Úä ØÑíŞ ÇÓÊÑÌÇÚ ÇáÓØæÑÇáãİåÑÓÉ æÅäÔÇÁ åÏİ æÈíÇäÇÊ ÌÏíÏå Íæáå

]]--
--#if l.class == "dialogue" İŞØ áÅÖÇİÉ ÓØæÑ ÇáÊÚáíŞ	              
--# not l.comment  : áãÚÑİÉ ÅĞÇ ßÇä ÇáÓØÑÇáãÖÇİÉ ÚÈÇÑÉ Úä ÊÚáíŞ ÃæÈÇáÃÍÑì ÚÈÇÑÉ ÍæÇÑ "dialogue " áíÓ áåÇ İÇÆÏÉ ãåãÉ åí ÈÇáÃÕğá ÊÔÇÑß 
--#not l.comment  then : íãßäß Ãä ÊÍĞİåÇ Ãä ßäÊ ÊÚÑİ ßíİ ÊÕÍÍ ÇáÓßÑÈÊ İí ÍÇá ÍĞİåÇ ^^ Ü 

		if l.class == "dialogue" and  not l.comment then 
                                    --#åí ÊÚãá æÊÓÊÏÚì ãä ŞÈá "ÇáİäßÔä " Ü  ass ÍÓÇÈ æÊŞÏíÑ ÇáÍÌã :ÈæÖÚ ãÚáæãÇÊ ÇáÃÎÑì ÇáãÎÊáİÉ áÜ ãáİ 
                                   --#  function do_fx(subs, meta, line)
		karaskel.preproc_line(subs, meta, styles, l)
		do_fx(subs, meta, l) 
	                  maxi = maxi - 1
	                 subs.delete(i) --# ÑÇÌÚ ÇáÔÑÍ ÈÇáÃÓİá

--[[ subs.delete(i)
  ÃíåÇ ÇáÚŞáÇÁ( ŞáÊ ÇáÚŞáÇÁ ÇáİåãÇÁ) ŞÏ ÊÌÏæä ÃãÑåÇ ÛÑíÈÇ ÕÍíÍ..İåí æŞÍÉ æáßä İÇÆÏÊåÇ ÌÚáäí ÃŞæá ÚäåÇ ÅäåÇ ÌãíáÉ 
İÇÆÏÊåÇ íÇ ÃÍÈÇÆí (ÃŞÕÏßã ^^ ) ÅäåÇ ÊŞæã ÈÜ ÚãáíÉ ÊØåíÑ ( áÇ ÃŞÕÏ ãÕØáÍ ÇáÊØåíÑ ÇáÚÑŞí ) åí ÊÓáÎ ãáİ ÇáßÇÑÇæßí ÇáãÄŞÊå æÊŞæã ÈÊÕÍíÍåÇ  
æÍĞİ ÇáÔíÁ ÇáÛíÑ ãÑÛæÈ İíåÇ ¡ ßãÇ ÃÚÑİ ÇáÈÚÖ áÇ íİåãæã ÅáÇ ÈãËÇá .. ÇáãËÇá: Şã ÈÍĞİ åĞÇ ÇáÃãÑ æÇäÙÑ æÔÇÇÇåÏ ãÇ ÓíÍÏË áãáİ ÇáßÇÑÇæßí 
æÑÇÍ ÊÚÑİ ŞÕÏí Òíä ãÇÇÇÇ Òíä ¡ æÇáÃİÖá Ãä ÊÚíÏ ŞÑÇÁÉ åĞÇ ÇáÔÑÍ ÇáÈÓíØ
[[ subs.delete(i)  äåÇíÉ ÔÑÍ 
	                 else
		i = i + 1
		end
		ai = ai + 1
	end
end
-- ÇáÏáíá áãáİ ÇáßÇÑÇ ÇáãÄŞÊå æãÚÑİÉ ÚÏÏ ÇáÓØæÑ , æÇáÓØÑ ÇáÃæá ÈÇáãáİ ÊÔíÑ æÊÈÏÃ ÈÇáÑŞã æÇÍÏ
-- i (ÊÔíÑ Åáì ÑŞã ãÚíä-1) - 
--##<><><><><><><><><><><><>##<><><><><><><><><><>##<><><><><><><><><><>##--

                 function do_fx(subs, meta, line)
	for i = 1, line.kara.n do
local l = line --# ÅĞÇ ŞãÊó ÈÍĞİåÇ áä ÊÚãá ÇáÓßÑÈÊ ÅáÇ İí ÍÇáÉ ( line ) íÓÇæí (l)  ÈÇáÃÕá áÇ íßÊÈ ÈÇáÓßÑÈÊ æáßäí ŞãÊ ÈÅäÔÇÆåÇ áÃæÖÍ ááÃãÑ ÇáĞí ÈÇáÃÓİá Ãä 
--[[ <<-----
 Ãä äßÊÈ ÇáÃãÑ ÈÇáÃÓİá ÈÇáÔßá ÇáÍÇáí <<--
local syl = line.kara[i]
]]
local syl = l.kara[i]

if i == 1 then Universo = 0 --#  İÇÆÏÉ åĞå ÃäåÇ ÊŞæã Úáì ÏÎæá ÇáäÕ ÈÇáÊÏÑÌ
end
--[[  æåí ÈÇáÃÕá ÊßÊÈ ÈÇáÅÓÈÇäíÉ åßĞÇ
if i == 1 then 
tiempo = 0
end
æÇáãÚáæã Ãä ÍÑİ (ÇáÂí) åí ÈÇáÃÕá ÊÔíÑ ááÑŞã æÇÍÏ
]]--

--------------------------------------##--------------------------------------##--------------------------------------##
--------------------------------------##--------------------------------------##--------------------------------------##
-- ÑÇÍ äÈÏÃ ÈÓØæÑ ÇáÊÃËíÑÇÊ áĞáß ËÈÊæÇ ÃäİÓßã ÈŞæÉ İÇáŞØÇÑ ÓíäØáŞ ÈŞæÉ æÃÎÔì Ãä íŞÚ ÃÍÏßã æíÍÏË Èíäí æÈíäßã ÇäÔŞÇŞ æİæÉ 
--------------------------------------##--------------------------------------##--------------------------------------##
--------------------------------------##--------------------------------------##--------------------------------------##


--##<><><><><><><><><><><><>##<><><><><><><><><><>##<><><><><><><><><><>##--
--XxXxXxXxXxX-- ÇáãŞØÚ ÇáÃæá ááÊÃËíÑ- ÊÃËíÑ ÇáÏÎæá  --XxXxXxXxXxX--

	l = table.copy(line)
	l.text = string.format("{\\pos(%d,%d)\\an5\\fad(100,0)}%s", line.left+syl.center, line.middle, syl.text )
	l.start_time=line.start_time-100 + Universo
	l.end_time=line.start_time+syl.start_time
	l.layer = 1
	subs.append(l)
  
--><><><><><><><><><>--<><><><><><><><><><>
--İí ÍÇá ÃÑÏÊ ÊØÈíŞ ÇáÊÃËíÑ Úáì äÕ æÅĞÇ ßÇä ÑÓãÉ íÌÈ ãÍæ åĞÇ ÇáÑãÒ (%s) íÊã ßÊÇÈÉ åĞÇ ÇáÑãÒ 
-- l.text = string.format  ÈÚÏ ßÊÇÈÊåÇ ÊÊã İÈÑßÊ ÇáÃßæÇÏ áÕäÚ ÊÃËíÑ ãÚíä
-- ("{åäÇ áßÊÇÈÉ æİÈÑßÊ ÇáÃßæÇÏ}"
-- syl.text  ááÊÏáíá Úáì Ãä ÇáÊÃËíÑ ÊØÈŞ Úáì ÍÑæİ ÇáßÇÑÇæßí
--><><><><><><><><><>--<><><><><><><><><><>

--##<><><><><><><><><><><><>##<><><><><><><><><><>##<><><><><><><><><><>##--
--XxXxXxXxXxX-- ÇáãŞØÚ ÇáËÇäí ááÊÃËíÑ ( äØŞ ÇáãÛäí ) æÇáÊí ÊÚÑİ ÃíÖÇ ÈÇáÊÃËíÑ ÇáäÔØ --XxXxXxXxXxX--

		local l = table.copy(line)
		l.start_time = line.start_time + syl.start_time --# åĞå åí ÈÏÇíÉ ÇáÊæŞíÊ æåí ÙåæÑ ÇáÊÃËíÑ
		if syl.duration < 750 then --# ŞÇÚÏÉ Åİ (ÊÓãì ÈÇáÌãáÉ ÇáÔÑØíÉ İí ÇáÈÇíËæä )ÔÑÍåÇ ÌäÇÒÉ İí ãæŞÚå ÇáŞÏíã ÅÑÌÚ áåÇ
		l.end_time = l.start_time + 1500
		else
		l.end_time = l.start_time + syl.duration * 4.5 -- ÊæŞíÊ ÇáäåÇíÉ ¡ Êã ÙÑÈ ÇáÓÇíá ÏæÑíÔä ÈËáÇËÉ áÒíÇÏÉ ãÏÉ ÈŞÇÁ ÊÃËíÑ äØŞ ÇáãÛäí 
		end -- äÖÚåÇ İí ÍÇáÉ ÇÓÊÎÏÇã ŞÇÚÏÉ Åİ ááÅÚáÇä Úä ÇäåÇÁ ÇáŞÇÚÏÉ ( áÇ ÃŞÕÏ ÇáŞÇÚÏÉ Ãæ ÍÑßÉ ØÇáÈÇä ) Ü
		l.layer = 2 --# ÊÍÏíÏ ØÈŞÉ ÇáÊÃËíÑ
		local tempo = string.format("{\\be1\\move(%d,%d,%%d,%%d)\\an5\\fad(0,150)\\1a&Hd0\\1cHFFFFFF&\\bord0\\shad0\\t(0.5,\\be3\\1a&HFF&)}%s", line.left+syl.center, line.middle, syl.text)
		for j = -10,10 do --#  ÊÍÏíÏ ÚÏÏ äÓÎ ÇáÍÑİ (ÇáÓÇáÈ ÈÇáÈÏÇíÉ ÊİíÏ ÈÊİÑíŞ ÇáÍÑæİ Çáì ÌåÉ ÓÇáÈ "æÇí" æÇáÑŞã ÇáÚÔÑÉ ÇáËÇäíÉ åí ÌåÉ ÇáãæÌÈ "æÇí" ) Ü
		l.text = string.format(tempo, line.left+syl.center+math.cos(math.rad(j*6))-15, line.middle+math.sin(math.rad(j*6))*30) --- ÊÓÇÚ ÑŞÚÉ ÇáÍÑİ İí ãÍæÑ ÇáÓíäí Úáì Ôßá ÏÇÆÑÉ
		subs.append(l)                                                                                               -- ÊÍæíá ÏÑÌÉ ÇáÓÇíä (20)¡ ÈÅÊÌÇå (ÇÊÓÇÚ) ÏÑÌÉ ÇáÑÇÏ (30) Ü
		end
-- for j = 0,20 -- íãßäß ÇÓÊÎÏÇã åĞå ÇáÃÓåá æÇáÃİÖá İŞØ Şã ÈÊÛííÑ ÇáÑŞã ÚÔÑíä áÊÍÏíÏ ÚÏÏ ÇáäÓÎ

--##<><><><><><><><><><><><>##<><><><><><><><><><>##<><><><><><><><><><>##--  
--@@ åĞå ãÏáæáÇÊ ÑíÇÖíÇÊ ÊÔíÑ áÒæÇíÇ æŞíÇÓÇÊ ãÚíä ááãÒíÏ Íæá ÇáÃãÑ ÇÓÃáæÇ ØáÈÉ ÇáÃæá ÇáËÇäæí áÃåá ÇáÅãÇÑÇÊ áÃäåã ÃÎĞæ ÏÑæÓ íÊÚáŞ ÈåĞå ÇáãÏáæáÇÊ
--><><><><><><><><><><><><><><><><>---
--math.rad : ÊÍæíá ÇáÒÇæíÉ Åáì ÏÑÌÉ ÇáÑÇÏíÇä
--math.cos :  ÅÚÇÏÉ ÒÇæíÉ "ÌíÈ ÇáÊãÇã (ßæÓ)" Åáì ŞíÇÓ ÇáÑÇÏíÇä"Ü 
--math.cos(math.rad(j*6))-15 // ãËÇá
--><><><><><><><><><><><><><><><><>---
--><><><><><><><><><><><><><><><><>---
--math.sin ÅÚÇÏÉ ÒÇæíÉ"ÇáÌíÈ" Åáì ŞíÇÓ ÇáÑÇÏíÇä
-- math.sin(math.rad(j*6))*30) // ãËÇá
--math.sin --  áÊÔßíá ÇáÑÓãÉ Çæ ÇáÍÑİ Úáì åíÆÉ ÏÇÆÑÉ Ãæ İÑÇÔÉ æÃÔßÇá ÃÎÑì
--><><><><><><><><><><><><><><><><>---

--##<><><><><><><><><><><><>##<><><><><><><><><><>##<><><><><><><><><><>##--
--XxXxXxXxXxX-- ÇáãŞØÚ ÇáËÇáË ááÊÃËíÑ ( ÈÚÏ ÇáäÔØ ) æåí ÇáÊÃËíÑ ÇáÊí ÊÚÑİ ÈÇáÓÇßäÉ --XxXxXxXxXxX--

	l = table.copy(line)
	l.start_time=line.start_time+syl.start_time+20 
	l.end_time=l.end_time+20 + Universo
	l.text =string.format("{\\pos(%d,%d)\\1a&HFF&\\an5\\bord1\\fad(0,100)\\3c&HFFFFFF&}%s", line.left+syl.center, line.middle, syl.text_stripped)
	l.layer=3 -- ÊÍÏíÏ ØÈŞÉ ÇáÊÃËíÑ
	subs.append(l) -- äåÇíÉ ÊØÈíŞ åĞÇ ÇááíÑ"ÇáÊÃËíÑ" Úáì ãáİ ÊæŞíÊ ÇáßÇÑÇæßí      

--##<><><><><><><><><><><><>##<><><><><><><><><><>##<><><><><><><><><><>##--            
--XxXxXxXxXxX-- æåäÇß ÇáãŞØÚ ÇáÑÇÈÚ ááÊÃËíÑ ( ÈÚÏ ÇáÓÇßäÉ) æåí ÊÃËíÑ ÇáÎÑæÌ ¡ áã ÃÓÊÚãáåÇ áÚÏã ÇáÍÇÌÉ áåÇ --XxXxXxXxXxX--
--##<><><><><><><><><><><><>##<><><><><><><><><><>##<><><><><><><><><><>##--

--# İí ÇáäåÇíÉ íÌÈ ßÊÇÈÉ ßáãÊÇ " ÅäÏ " ãÑÊÇä , æÇáÓÈÈ Øæíá áÃäå İí ÍÇáÉ Êã ßÊÇÈÊåãÇ ŞÈá ÈÏÇíÉ ÓØæÑ ÇáÊÃËíÑÇÊ ÑÇÍ íÊÛíÑ ÇáãÚÇÏáÉ ¡ ĞßÑÊ ÇáÃãÑ ÈÇÎÊÕÇÑ æÚáì ÇáÓÑíÚ
      end
end

aegisub.register_filter("Future Windy Blur", "~ALKOON~", 2000, new_windy_blur)
--# aegisub.register_filter("name" ," description", priority, function) --# ãÚáæãÉ æáÇ íÍÊÇÌ ááÔÑÍ #--
--===================================

--# åĞÇ æÇááå ÃÚáã .. æÇáÍãÏááå ßËíÑÇ

--#http://jnazh-karaoke.ahlamontada.net/forum.htm